In [2]:
import pandas as pd
import numpy as np

In [5]:
long_series = pd.Series(np.random.randn(1000))
long_series.head()

0   -0.040654
1    0.529932
2    0.463331
3    1.383014
4    1.240113
dtype: float64

In [6]:
long_series.tail()

995    0.549928
996    0.773920
997   -1.822269
998   -0.399055
999    0.176995
dtype: float64

# Matching / broadcasting behavioR

In [10]:
df = pd.DataFrame({ 'one' : pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
                    'two' : pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
                    'three' : pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})
df

        one       two     three
a  0.935778  0.383943       NaN
b  1.112203  1.013058  0.940904
c -1.537127 -1.502137  0.363467
d       NaN  0.820452  0.577752

In [12]:
row = df.iloc[1]
row

one      1.112203
two      1.013058
three    0.940904
Name: b, dtype: float64

In [13]:
column = df['two']
column

a    0.383943
b    1.013058
c   -1.502137
d    0.820452
Name: two, dtype: float64

In [28]:
df.sub(row,axis='columns')

        one       two     three
a -0.176425 -0.629115       NaN
b  0.000000  0.000000  0.000000
c -2.649330 -2.515196 -0.577437
d       NaN -0.192606 -0.363152

In [36]:
df.sub(row, axis=1)

        one       two     three
a -0.176425 -0.629115       NaN
b  0.000000  0.000000  0.000000
c -2.649330 -2.515196 -0.577437
d       NaN -0.192606 -0.363152

In [43]:
df.sub(column,axis='index')

        one  two     three
a  0.551835  0.0       NaN
b  0.099144  0.0 -0.072154
c -0.034990  0.0  1.865604
d       NaN  0.0 -0.242700